Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_Framework_SwiftUI/project_save.tmx
Source language: en_us
Languages: ja

source: A WatchKit user notification interface controller that hosts a SwiftUI view hierarchy.
ja: あるWatchKitユーザ通知インターフェイスコントローラ、それはSwiftUIビュー階層をホストします。

source: A WatchKit user notification interface controller which hosts a SwiftUI view hierarchy.
ja: WatchKitユーザ通知インターフェイスコントローラ、それはSwiftUIビュー階層をホストします。

source: A binding connects a property to a source of truth stored elsewhere, instead of storing data directly.
ja: バインディングは、あるプロパティをどこか他で格納される信頼できる情報源に接続します、データを直接に格納することなしに。

source: A binding that updates when a drag and drop operation enters or exits the drop target area.
ja: ドラッグ＆ドロップ操作がドロップ目標エリアに入るまたは出る時に更新するあるバインディング。

source: A binding to a Boolean value that determines the group’s expansion state (expanded or collapsed).
ja: グループのもつ展開状態（展開されたまたは折りたたまれた）を決定するブール値へのあるバインディング。

source: A binding to a selected row.
ja: 選択された行へのあるバインディング。

source: A binding to a selected value.
ja: 選択された値へのあるバインディング。

source: A binding to a set that identifies selected rows.
ja: ある集合へのバインディング、それは選択された行を識別します。

source: A binding to a view’s GestureState property.
ja: あるビューのもつGestureStateプロパティへのバインディング。

source: A binding to an optional source of truth for the action sheet.
ja: アクションシートに対するある随意の信頼できる情報源へのあるバインディング。

source: A binding to an optional source of truth for the alert.
ja: アラートに対するある随意の信頼できる情報源へのあるバインディング。

source: A binding to an optional source of truth for the cover modal view.
ja: カバーモーダルビューに対するある随意の信頼できる情報源へのあるバインディング。

source: A binding to an optional source of truth for the popover.
ja: ポップオーバーに対するある随意の信頼できる情報源へのあるバインディング。

source: A binding to an optional source of truth for the sheet.
ja: シートに対するある随意の信頼できる情報源へのあるバインディング。

source: A binding to the current presentation mode of the view associated with this environment.
ja: この環境と結びつけられたビューの現在の提示モードへのバインディング。

source: A binding to the gesture state property.
ja: ジェスチャ状態プロパティへのバインディング。

source: A binding to the optional value.
ja: オプショナル値へのあるバインディング。

source: A binding to the state value.
ja: 状態値へのバインディング。

source: A binding to whether the action sheet should be shown.
ja: アクションシートが示されるべきかどうかへのあるバインディング。

source: A binding to whether the alert should be shown.
ja: アラートが示されるべきかどうかへのあるバインディング。

source: A binding to whether the modal view is presented.
ja: モーダルビューが提示されるかどうかへのあるバインディング。

source: A binding to whether the popover is presented.
ja: ポップオーバーが提示されるかどうかへのあるバインディング。

source: A binding to whether the sheet is presented.
ja: シートが提示されるかどうかへのあるバインディング。

source: A blur is more diffuse when its radius is large.
ja: ぼかしは、それの半径が大きい時により拡散します。

source: A built-in group of commands for searching, editing, and transforming selections of text.
ja: 選択テキストの検索、編集、変換のためのコマンドの組み込みグループ。

source: A built-in set of commands for manipulating window sidebars.
ja: ウインドウサイドバーを操作するためのコマンドの組み込みセット。

source: A built-in set of commands for manipulating window toolbars.
ja: ウインドウツールバーを操作するためのコマンドの組み込みセット。

source: A built-in set of commands for transforming the styles applied to selections of text.
ja: 選択テキストに適用するスタイルを変換するコマンドの組み込みセット。

source: A button representing an operation of an action sheet presentation.
ja: アクションシート提示の操作を表しているボタン。

source: A button representing an operation of an alert presentation.
ja: 警報提示の操作を表しているボタン。

source: A button style for buttons that emulate links.
ja: リンクと同じ機能を果たすボタンに対するボタンスタイル。

source: A button style that applies standard border artwork based on the button’s context.
ja: あるボタンスタイル、それは、標準境界線アートワークをボタンのもつ文脈に基づき適用します。

source: A button style that doesn’t apply a border.
ja: 境界線（ボーダー）を適用しないボタンスタイル。

source: A button style that doesn’t pad the content, and applies a motion effect when a button has focus.
ja: あるボタンスタイル、それはその内容に周りの詰めをしません、そしてあるモーションエフェクト（運動効果）をボタンがフォーカスされる時に適用します。

source: A button style that doesn’t style or decorate its content while idle, but may apply a visual effect to indicate the pressed, focused, or enabled state of the button.
ja: あるボタンスタイル、それは、アイドル状態の間それの内容をスタイル指定しませんまたは装飾しません、しかしある視覚効果を適用して、そのボタンの押される、フォーカスされる、または可能にされる状態を指し示すかもしれません。

source: A button that displays a menu containing a list of choices when pressed.
ja: あるボタン、それは押された時に選択肢のリストを含んでいるメニューを表示します。

source: A button that toggles the edit mode for the current edit scope.
ja: あるボタン、それは現在の編集領域に対する編集モードを引き起こします。

source: A button that triggers a navigation presentation when pressed.
ja: あるボタン、それは押された時にナビゲーション提示を引き起こします。

source: A capsule shape aligned inside the frame of the view containing it.
ja: それを含んでいるビューのフレーム内部に配置されるカプセル形状。

source: A capsule shape is equivalent to a rounded rectangle where the corner radius is chosen as half the length of the rectangle’s smallest edge.
ja: カプセル形状は、丸みのある矩形に等しいです、そこで角半径は矩形のもつ最も小さい端の長さの半分として選ばれます。

source: A circle centered on the frame of the view containing it.
ja: ある円、それを含んでいるビューの枠内の中心に置かれます。

source: A class of types whose instances hold the value of an entity with stable identity.
ja: 型それらのあるクラス、それのインスタンスそれらは安定した同一性をもつある登録項目の値を保持します。

source: A closure executed when the modal view dismisses.
ja: モーダルビューが離れてもいいという許可を出す時に遂行されるクロージャ。

source: A closure executed when the sheet dismisses.
ja: シートが離れてもいいという許可を出す時に遂行されるあるクロージャ。

source: A closure providing the configuration of the overlay.
ja: オーバーレイの構成設定を提供しているあるクロージャ。

source: A closure returning the ActionSheet to present.
ja: 提示するActionSheetを返しているあるクロージャ。

source: A closure returning the action sheet to present.
ja: 提示するアクションシートを返しているあるクロージャ。

source: A closure returning the alert to present.
ja: 提示するアラートを返しているあるクロージャ。

source: A closure returning the content of the modal view.
ja: モーダルビューの内容を返しているクロージャ。

source: A closure returning the content of the popover.
ja: ポップオーバーの内容を返しているクロージャ。

source: A closure returning the content of the sheet.
ja: シートの内容を返しているあるクロージャ。

source: A closure that SwiftUI invokes when elements are added to the view.
ja: あるクロージャ、それは要素それらがビューに加えられる時にSwiftUIが発動します。

source: A closure that SwiftUI invokes when elements in the dynamic view are moved.
ja: あるクロージャ、それは動的ビューの中の要素それらが移動される時にSwiftUIが発動します。

source: A closure that accepts an element of this sequence as its argument and returns a sequence or collection.
ja: あるクロージャ、それはこのシーケンスのひとつの要素をそれの引数として受け取って、あるシーケンスまたはコレクションを返すものです。

source: A closure that accepts an element of this sequence as its argument and returns an optional value.
ja: あるクロージャ、それはこのシーケンスのひとつの要素をそれの引数として受け取って、ひとつのオプショナルの値を返すものです。

source: A closure that combines an accumulating value and an element of the sequence into a new accumulating value, to be used in the next call of the nextPartialResult closure or returned to the caller.
ja: あるクロージャ、それはある蓄積値とシーケンスのある要素を新しい蓄積値へと結合して、nextPartialResultクロージャの次の呼び出しにおいて使われるか呼出し側に返されるようにします。

source: A closure that provides a Transaction.
ja: Transactionを提供するあるクロージャ。

source: A closure that retrieves the binding value.
ja: あるクロージャ、それはバインディング値を回収するものです。

source: A closure that returns a Boolean value indicating whether two elements are equivalent.
ja: あるクロージャ、それは２つの要素が等しいかどうかを指し示しているブール値を返します。

source: A closure that returns a single NSItemProvider that represents the draggable data from this view.
ja: あるクロージャ、それはある単一のNSItemProviderです、それはこのビューからドラッグ可能なデータを表します。

source: A closure that returns the next value in the sequence.
ja: あるクロージャ、それはそのシーケンスの中の次の値を返します。

source: A closure that returns the offset value to apply to this view.
ja: あるクロージャ、それはこのビューに適用するオフセット値を返します。

source: A closure that sets the binding value.
ja: あるクロージャ、それはバインディング値を設定します。

source: A closure that takes an element as an argument and returns a Boolean value indicating whether the collection should be split at that element.
ja: あるクロージャ、それは１つの要素を引数として取り、コレクションがその要素で分割されるかどうかを指し示すブール値を返します。

source: A closure that takes an element as its argument and returns a Boolean value that indicates whether the passed element represents a match.
ja: あるクロージャ、それは１つの要素をそれの引数として取り、渡された要素が合致するものであるかどうかを指し示すブール値を返します。

source: A closure that takes an element of the sequence as a parameter.
ja: あるクロージャ、それはシーケンスの１要素を引数として取ります。

source: A closure that takes an element of the sequence as its argument and returns true if the element should be included or false if it should be excluded.
ja: あるクロージャ、それはシーケンスの１つの要素をそれの引数として取り、その要素が含まれるべきならばtrueをまたはそれが除外されるべきならばfalseを返します。

source: A closure that takes an element of the sequence as its argument and returns true if the element should be skipped or false if it should be included.
ja: あるクロージャ、それはシーケンスの１つの要素をそれの引数として取り、その要素が省かれるべきならばtrueをまたはそれが含まれるべきならばfalseを返します。

source: A closure that takes an element of the sequence as its argument and returns a Boolean value indicating whether the element is a match.
ja: あるクロージャ、それは１つの要素をそれの引数として取り、その要素が合致するものかどうかを指し示しているブール値を返します。

source: A closure that takes an element of the sequence as its argument and returns a Boolean value indicating whether the element should be included in the returned array.
ja: あるクロージャ、それは１つの要素をそれの引数として取り、その要素が返される配列に含まれるべきかどうかを指し示しているブール値を返します。

source: A closure that takes an element of the sequence as its argument and returns a Boolean value that indicates whether the passed element represents a match.
ja: あるクロージャ、それはこのシーケンスの１つの要素をそれの引数として取り、渡された要素がある合致を表すものであるかどうかを指し示すブール値を返します。

source: A closure that takes an element of the sequence as its argument and returns a Boolean value that indicates whether the passed element satisfies a condition.
ja: あるクロージャ、それはこのシーケンスの１つの要素をそれの引数として取り、渡された要素があるコレクションを満たすものであるかどうかを指し示すブール値を返します。

source: A closure that takes the dropped content and responds appropriately.
ja: あるクロージャ、それはドロップされた内容を取り、そして適切に応答するものです。

source: A closure that updates the accumulating value with an element of the sequence.
ja: 蓄積される値をこのシーケンスのある要素を使って更新するクロージャ。

source: A closure that’s called whenever this view either gains or loses focus.
ja: あるクロージャ、それはこのビューがフォーカスを得るまたは失うどちらかの時はいつでも呼び出されます。

source: A closure to execute.
ja: 遂行するクロージャ。

source: A closure to retrieve the binding value.
ja: バインディング値を回収するクロージャ。

source: A closure to run when the value changes.
ja: 値が変化する時に実行することになるクロージャ。

source: A closure to set the binding value.
ja: バインディング値を設定するクロージャ。

source: A collection of all values of this type.
ja: この型の全ての値からなるコレクション。

source: A collection of environment values propagated through a view hierarchy.
ja: ビュー階層を通して伝播される環境値それらからなるあるコレクション。

source: A collection of environment values.
ja: 環境値それらからなるあるコレクション。

source: A collection of identifiable data for computing the list.
ja: リストを計算するための身元識別可能なデータのコレクション。

source: A collection of state exported by the focused view and its ancestors.
ja: フォーカスされたビューとそれの祖先によってエクスポートされる状態のコレクション。

source: A collection of views that the Touch Bar displays.
ja: ビューいくつかからなるあるコレクション、それはTouch Barが表示するものです。

source: A collection of views to be displayed by the Touch Bar.
ja: Touch Barによって表示されることになる、いくつかのビューからなるあるコレクション。

source: A color gradient represented as an array of color stops, each having a parametric location value.
ja: 色経由それらからなるある配列として表されるある色勾配、それぞれはパラメータ的位置値を持ちます。

source: A color that represents the accent color in the current environment.
ja: ある色、それはアクセントカラーを現在の環境において表します。

source: A color that represents the system or application accent color.
ja: ある色、それはシステムまたはアプリケーションの強調色を表します。

source: A common usage is with enumerations:
ja: 一般的な使用法は、列挙でとなります：

source: A compositing group makes compositing effects in this view’s ancestor views, like opacity and the blend mode, take effect before this view renders.
ja: 合成グループは、このビューのもつ祖先ビューに合成する効果をもたらします、不透明そしてブレンドモードのように、このビューの描画の前に効果を持ちます。

source: A compositing group makes compositing effects in this view’s ancestor views, such as opacity and the blend mode, take effect before this view is rendered.
ja: 合成グループは、エフェクト（効果）をこのビューのもつ祖先ビューに合成します、たとえば不透明そしてブレンドモードなど、このビューが描出される前に効果を表します。

source: A configuration for a navigation bar that represents a view at the top of a navigation stack.
ja: ナビゲーションバーに対する構成設定、それはあるビューをナビゲーションスタックの最上部で表します。

source: A configuration for a style with a custom appearance and custom interaction behavior.
ja: あつらえの外観とあつらえの相互作用挙動をもつスタイルに対する構成設定。

source: A constant containing the transformation of a string by removing combining marks.
ja: 結合記号を取り除くことによるある文字列の変換を含んでいる定数。

source: A constant containing the transformation of a string by removing diacritics.
ja: 区別的発音符を取り除くことによるある文字列の変換を含んでいる定数。

source: A constant containing the transformation of a string from characters to XML hexadecimal escape codes.
ja: 文字からXML16進法エスケープコードへのある文字列の翻字を含んでいる定数。

source: A constant containing the transformation of a string from full-width CJK characters to half-width forms.
ja: 全角CJK文字から半角形式へのある文字列の翻字を含んでいる定数。

source: A constant containing the transliteration of a string from Han script to Latin.
ja: Han書体からLatinへのある文字列の翻字を含んでいる定数。

source: A constant containing the transliteration of a string from Hiragana script to Katakana script.
ja: Hiragana書体からKatakana書体へのある文字列の翻字を含んでいる定数。

source: A constant containing the transliteration of a string from Latin script to Arabic script.
ja: Latin書体からArabic書体へのある文字列の翻字を含んでいる定数。

source: A constant containing the transliteration of a string from Latin script to Cyrillic script.
ja: Latin書体からCyrillic書体へのある文字列の翻字を含んでいる定数。

source: A constant containing the transliteration of a string from Latin script to Greek script.
ja: Latin書体からGreek書体へのある文字列の翻字を含んでいる定数。

source: A constant containing the transliteration of a string from Latin script to Hangul script.
ja: Latin書体からHangul書体へのある文字列の翻字を含んでいる定数。

source: A constant containing the transliteration of a string from Latin script to Hebrew script.
ja: Latin書体からHebrew書体へのある文字列の翻字を含んでいる定数。

source: A constant containing the transliteration of a string from Latin script to Hiragana script.
ja: Latin書体からHiragana書体へのある文字列の翻字を含んでいる定数。

source: A constant containing the transliteration of a string from Latin script to Katakana script.
ja: Latin書体からKatakana書体へのある文字列の翻字を含んでいる定数。

source: A constant containing the transliteration of a string from Latin script to Thai script.
ja: Latin書体からThai書体へのある文字列の翻字を含んでいる定数。

source: A constant containing the transliteration of a string from any script to Latin script.
ja: 何らかの書体からLatin書体へのある文字列の翻字を含んでいる定数。

source: A container event handler that evaluates its two child gestures simultaneously.
ja: あるコンテナイベントハンドラ、それはそれの２つの子ジェスチャを同時に評価します。

source: A container for a view that you can show in the Touch Bar.
ja: あなたがTouch Barにおいて表示できるビューに対するコンテナ。

source: A container for an alert presentation.
ja: 警報提示のためのコンテナ。

source: A container for grouping controls used for data entry, such as in settings or inspectors.
ja: たとえば設定または調査において、データ登録項目に対して使われるコントロールをグループにするためのコンテナ。

source: A container for views that you present as a menu items in a contextual menu in response to the standard system gesture.
ja: あなたがメニュー項目それらとしてあるコンテキストメニューの中に標準システムジェスチャに応答して提示するビューそれらに対するあるコンテナ。

source: A container for views that you present as menu items in a contextual menu after completion of the standard system gesture.
ja: あなたがメニュー項目それらとして、あるコンテキストメニューの中に、標準システムジェスチャの完了の後に、提示するビューそれらに対するあるコンテナ。

source: A container that presents rows of data arranged in a single column.
ja: あるコンテナ、それは単一の縦列の中に配置されるデータの横列それらを提示します。

source: A container used to expose multiple widgets from a single widget extension.
ja: ある単一のウィジェット拡張から複数のウィジェットを露出するために使われるあるコンテナ。

source: A container view that defines its content as a function of its own size and coordinate space.
ja: あるコンテナビュー、それはそれの内容をそれ独自の大きさと座標空間の相関関係として定義します。

source: A context menu container for views that you present as menu items in a contextual menu.
ja: いくつかのビューに対するあるコンテキストメニューコンテナ、それらはあなたがいくつかのメニュー項目としてあるコンテキストによるメニューの中に提示するものです。

source: A context structure containing information about the current state of the system.
ja: システムの現在の状態についての情報を含んでいる前後関係構造体。

source: A control for navigating to a URL.
ja: あるURLへと案内するためのコントロール。

source: A control for presenting a menu of actions.
ja: アクションいくつかからなるあるメニューを提示するためのコントロール。

source: A control for selecting a value from a bounded linear range of values.
ja: 値いくつかからなる有界線形範囲からある値を選択するためのコントロール。

source: A control for selecting an absolute date.
ja: 絶対日付を選択するためのコントロール。

source: A control for selecting from a set of mutually exclusive values.
ja: 一揃いの相互に排他的な値から選択するためのコントロール。

source: A control into which the user securely enters private text.
ja: それへとユーザが安全にプライベートテキストを入力するあるコントロール。

source: A control that displays an editable text interface.
ja: あるコントロール、それは編集可能なテキストインターフェイスを表示します。

source: A control that performs an action when triggered.
ja: あるコントロール、それは作動された時にあるアクションを実行します。

source: A control that toggles between on and off states.
ja: オンおよびオフ状態の間でトグルする（同じ操作で２状態を切り替える）コントロール。

source: A control that you add to your interface to allow users to sign in with their Apple ID.
ja: あるコントロール、それはあなたがあなたのインターフェイスに加えて、ユーザに彼らのApple IDでサインインすることを可能にするものです。

source: A control used to perform semantic increment and decrement actions.
ja: 意味論的な漸増と漸減動作の実行のために使われるコントロール。

source: A control used to select a color from the system color picker UI.
ja: ある色をシステムカラーピッカ−UIから選択するために使われるあるコントロール。

source: A convenience property wrapper for observing and automatically unwrapping state bindings from the focused view or one of its ancestors.
ja: フォーカスされたビューまたはそれの祖先の１つからの状態バインディングそれらを監視するまたは自動アンラップすることに対する便宜プロパティラッパー。

source: A cubic Bézier curve from the previous current point to the given end-point, using the two control points to define the curve.
ja: 以前の現在の地点からこの与えられた終了点までの３次ベジェ曲線、２つの制御点を曲線を定義するのに使っています。

source: A custom parameter attribute that constructs views from closures.
ja: あるあつらえのパラメータ属性、それはビューをクロージャから組み立てるものです。

source: A custom specification for the appearance and interaction of a Picker.
ja: Pickerの外観と相互作用に対するカスタム仕様。

source: A delegate object that receives messages about the parsing process.
ja: ある委任先オブジェクト、それは構文解析処理についてメッセージを受け取ります。

source: A description of this view to display in the navigation bar.
ja: ナビゲーションバーにおいて表示するためのこのビューの説明。

source: A design to use for fonts.
ja: フォントに対して使うデザイン。

source: A directional indicator you use when making an accessibility adjustment.
ja: アクセシビリティを調整する場合にあなたが使う方向指示子。

source: A disclosure group view consists of a label to identify the contents, and a control to show and hide the contents.
ja: 開示グループビューは、内容を識別するあるラベル、そして内容を表示したり隠したりするあるコントロールから成ります。

source: A document model definition used to serialize reference type documents to and from file contents.
ja: リファレンス型書類をそれへとそしてファイル内容からシリアライズするために使われる書類モデル定義。

source: A dragging motion that invokes an action as the drag-event sequence changes.
ja: あるドラッグ動作、それはあるアクションをそのドラッグイベントの一続きが変化するにつれて発動します。

source: A dynamic text style to use for fonts.
ja: フォントに対して使う動的テキストスタイル。

source: A dynamic view property that reads a value from the view’s environment.
ja: ある動的ビュープロパティ、それはある値をビューのもつ環境から読み出します。

source: A dynamic view property that stores state during performance of a gesture.
ja: ある動的ビュープロパティ、それはあるジェスチャの上演の間じゅう状態を格納します。

source: A dynamic view property that uses a bindable object supplied by an ancestor view to invalidate the current view whenever the bindable object changes.
ja: ある動的ビュープロパティ、それは祖先ビューによって提供されるバインド可能なオブジェクトを使用して、現在のビューを無効にします、バインド可能なオブジェクトが変化する時はいつでも。

source: A fixed width for the resulting view.
ja: 結果ビューに対するある治された幅。

source: A flag indicating whether this view should fit or fill the parent context.
ja: このビューが親コンテンツに収まるべきかまたはそれをいっぱいに満たすべきかを指し示しているフラグ。

source: A flag that indicates whether the locale uses the metric system.
ja: あるフラグ、それはそのロケールがメートル法体系を使うかどうかを指し示します。

source: A flattened view of the elements of this sequence of sequences.
ja: 複数のシーケンスの中のこのシーケンスの要素の平坦化された見方。

source: A flexible space that expands along the major axis of its containing stack layout, or on both axes if not contained in a stack.
ja: ある柔軟な空き、それはそれを収容しているスタックレイアウトの長軸に沿って、またはスタックの中に含まれないならば両方の軸上で拡張します。

source: A font with the body text style.
ja: ボディテキストスタイルでのフォント。

source: A font with the callout text style.
ja: コールアウトテキストスタイルでのフォント。

source: A font with the caption text style.
ja: キャプションテキストスタイルでのフォント。

source: A font with the footnote text style.
ja: 脚注テキストスタイルでのフォント。

source: A font with the headline text style.
ja: ヘッドラインテキストスタイルでのフォント。

source: A font with the large title text style.
ja: 大きなタイトルテキストスタイルでのフォント。

source: A font with the subheadline text style.
ja: サブヘッドラインテキストスタイルでのフォント。

source: A font with the title text style.
ja: タイトルテキストスタイルでのフォント。

source: A formatter that converts between dates and their ISO 8601 string representations.
ja: 日付とそれらのISO 8601文字列表現の間で変換をするフォーマッタ。

source: A formatter that converts between dates and their textual representations.
ja: 日付とそれらのテキスト表現の間で変換をするフォーマッタ。

source: A formatter that creates string representations of quantities of time.
ja: 一定量の時間の文字列表現を作成するフォーマッタ。

source: A formatter that creates string representations of time intervals.
ja: 時間間隔の文字列表現を作成するフォーマッタ。

source: A fraction between 0 and 1 (inclusive) you use to specify the minimum amount of text scaling that this view permits.
ja: 0と1（を含めて）の間の小数、このビューが許可するテキスト拡大縮小の最小限の量を指定するためにあなたが使用するもの。

source: A function you can use to create content on demand using the underlying data.
ja: あなたが基礎をなすデータを使って必要に応じて内容を作成するのに使用できるある関数。

source: A gauge illustrates the current level in relation to a finite capacity.
ja: ゲージ（計器）は、現在のレベル（水準）をある有限の容量に関連して図示します。

source: A geometric angle whose value you access in either radians or degrees.
ja: 幾何学的角度、それの値にあなたはラジアンまたは度のどちらかでアクセスします。

source: A gesture containing two gestures that can happen at the same time with neither of them preceeding the other.
ja: それらのどちらも他に先行しないで同時に起こりえる２つのジェスチャを含んでいるあるジェスチャ。

source: A gesture that consists of two gestures where only one of them can succeed.
ja: あるジェスチャ、それは２つのジェスチャから成ります、そこではそれらのただ１つだけが成功できます。

source: A gesture that ends once a long-press event sequence has been recognized.
ja: あるジェスチャ、それはいったん長押しイベントシーケンスが認識されたならば終わります。

source: A gesture that ends once a specified number of tap event sequences have been recognized.
ja: あるジェスチャ、それはいったんある指定された数のタップイベントシーケンスが認識されたならば終わります。

source: A gesture that invokes an action as a drag event sequence changes.
ja: あるジェスチャ、それはある動作をあるドラッグイベントシーケンスが変化するときに発動します。

source: A gesture that recognizes a magnification motion and tracks the amount of magnification.
ja: あるジェスチャ、それは拡大動作を認識します、そして拡大量を追跡します。

source: A gesture that recognizes a rotation motion and tracks the angle of the rotation.
ja: あるジェスチャ、それは回転動作を認識します、そして回転の角度を追跡します。

source: A gesture that recognizes one or more taps.
ja: あるジェスチャ、それは１つ以上のタップを認識します。

source: A gesture that succeeds when the user performs a long press.
ja: あるジェスチャ、それはユーザが長押しを実行する時に成功します。

source: A gesture that tracks how a magnification event sequence changes.
ja: あるジェスチャ、それはどのくらい拡大イベントシーケンスが変化したかを追跡します。

source: A gesture that tracks how a rotation event sequence changes.
ja: あるジェスチャ、それはどのくらい回転イベントシーケンスが変化したかを追跡します。

source: A gesture that triggers action when its value changes.
ja: あるジェスチャ、それはactionをそれの値が変化する時に引き起こします。

source: A gesture that triggers action when the gesture ends.
ja: ジェスチャが終わる時にactionを引き起こすジェスチャ。

source: A gesture that triggers action when this gesture’s value changes.
ja: あるジェスチャ、それはこのジェスチャのもつ値が変化する時にactionを引き起すものです。

source: A gesture that updates the state provided by a gesture’s updating callback.
ja: あるジェスチャ、それはジェスチャのもつ更新コールバックによって提供される状態の更新を行うものです。

source: A gesture that you use to create a new gesture.
ja: あるジェスチャ、それはあなたが新しいジェスチャを作成するために使うものです。

source: A gesture that you want to combine with your gesture to create a new, combined gesture.
ja: あるジェスチャ、それはあなたがあなたのジェスチャと結合してある新しい、結合されたジェスチャを作成したいものです。

source: A gesture that's a sequence of two gestures.
ja: あるジェスチャ、それは２つのジェスチャを順番に並べたものです。

source: A gesture that's the result of combining two gestures where only one of them can succeed.
ja: あるジェスチャ、それは２つのジェスチャを結合する結果です、そこではそれらのただ１つだけが成功できます。

source: A gesture that’s a sequence of two gestures.
ja: あるジェスチャ、それは２つのジェスチャを順番に並べたものです。

source: A gesture type that sequences two subgestures.
ja: あるジェスチャ型、それは２つのサブジェスチャを順番に並べたものです。
